<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/5db675a4-a4f2-452e-b1f9-550b0ccfa9b4/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.analytics.aws_kms_alias.analytics_bucket will be created
  + resource "aws_kms_alias" "analytics_bucket" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/analytics/cast/staging"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.analytics.aws_kms_key.analytics_bucket will be created
  + resource "aws_kms_key" "analytics_bucket" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "cast.staging - analytics bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Name"      = "walletconnect-staging-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
    }

  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket" "analytics-data-lake_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "walletconnect.cast.staging.analytics.data-lake"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Name"      = "walletconnect-staging-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl will be created
  + resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket will be created
  + resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"
        name                               = "staging-cast-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:29" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:29" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-cast" -> (known after apply)
      ~ revision                 = 29 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access will be created
  + resource "aws_iam_policy" "analytics-data-lake_bucket_access" {
      + arn         = (known after apply)
      + description = "Allows staging-cast to read/write from walletconnect.cast.staging.analytics.data-lake"
      + id          = (known after apply)
      + name        = "staging-cast_analytics-data-lake_bucket_access"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Name"      = "walletconnect-staging-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
    }

  # module.ecs.aws_iam_policy.geoip_bucket_access will be created
  + resource "aws_iam_policy" "geoip_bucket_access" {
      + arn         = (known after apply)
      + description = "Allows staging-cast to read from staging.relay.geo.ip.database.private.staging.walletconnect"
      + id          = (known after apply)
      + name        = "staging-cast_geoip_bucket_access"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect",
                        ]
                      + Sid      = "ListObjectsInGeoipBucket"
                    },
                  + {
                      + Action   = [
                          + "s3:CopyObject",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect/*",
                        ]
                      + Sid      = "AllObjectActionsInGeoipBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Name"      = "walletconnect-staging-cast"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
    }

  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-cast-ecs-task-execution-role"
    }

  # module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "geoip-bucket-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-cast-ecs-task-execution-role"
    }

  # module.o11y.grafana_dashboard.at_a_glance will be updated in-place
  ~ resource "grafana_dashboard" "at_a_glance" {
      ~ config_json  = jsonencode(
          ~ {
              ~ panels               = [
                    {
                        collapsed = false
                        gridPos   = {
                            h = 1
                            w = 24
                            x = 0
                            y = 0
                        }
                        panels    = []
                        title     = "Database"
                        type      = "row"
                    },
                  ~ {
                      ~ targets     = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-cast-keystore-docdb-primary-cluster" -> "prod-cast-keystore-docdb-primary-cluster"
                                }
                                id               = ""
                                # (14 unchanged attributes hidden)
                            },
                        ]
                        # (6 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets     = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-cast-keystore-docdb-primary-cluster" -> "prod-cast-keystore-docdb-primary-cluster"
                                }
                                id               = ""
                                # (14 unchanged attributes hidden)
                            },
                        ]
                        # (6 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets     = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-cast-keystore-docdb-primary-cluster" -> "prod-cast-keystore-docdb-primary-cluster"
                                }
                                id               = ""
                                # (14 unchanged attributes hidden)
                            },
                        ]
                        # (6 unchanged attributes hidden)
                    },
                  ~ {
                      ~ targets     = [
                          ~ {
                              ~ dimensions       = {
                                  ~ DBClusterIdentifier = "staging-cast-keystore-docdb-primary-cluster" -> "prod-cast-keystore-docdb-primary-cluster"
                                }
                                id               = ""
                                # (14 unchanged attributes hidden)
                            },
                        ]
                        # (7 unchanged attributes hidden)
                    },
                    {
                        collapsed = true
                        gridPos   = {
                            h = 1
                            w = 24
                            x = 0
                            y = 17
                        }
                        panels    = []
                        title     = "Graphs"
                        type      = "row"
                    },
                    # (1 unchanged element hidden)
                    {
                        datasource  = {
                            type = "prometheus"
                            uid  = "O62eDFJVz"
                        }
                        fieldConfig = {
                            defaults  = {
                                color      = {
                                    mode = "palette-classic"
                                }
                                custom     = {
                                    axisLabel         = ""
                                    axisPlacement     = "auto"
                                    barAlignment      = 0
                                    drawStyle         = "line"
                                    fillOpacity       = 0
                                    gradientMode      = "none"
                                    hideFrom          = {
                                        legend  = false
                                        tooltip = false
                                        viz     = false
                                    }
                                    lineInterpolation = "linear"
                                    lineStyle         = {
                                        fill = "solid"
                                    }
                                    lineWidth         = 1
                                    pointSize         = 5
                                    scaleDistribution = {
                                        type = "linear"
                                    }
                                    showPoints        = "auto"
                                    spanNulls         = false
                                    stacking          = {
                                        group = "A"
                                        mode  = "none"
                                    }
                                    thresholdsStyle   = {
                                        mode = "off"
                                    }
                                }
                                mappings   = []
                                thresholds = {
                                    mode  = "absolute"
                                    steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                        {
                                            color = "red"
                                            value = 80
                                        },
                                    ]
                                }
                            }
                            overrides = []
                        }
                        gridPos     = {
                            h = 8
                            w = 12
                            x = 12
                            y = 18
                        }
                        options     = {
                            legend  = {
                                calcs       = []
                                displayMode = "list"
                                placement   = "bottom"
                            }
                            tooltip = {
                                mode = "single"
                                sort = "none"
                            }
                        }
                        targets     = [
                            {
                                datasource   = {
                                    type = "prometheus"
                                    uid  = "O62eDFJVz"
                                }
                                exemplar     = true
                                expr         = "increase(dispatched_notifications{type=\"sent\"}[5m])"
                                interval     = ""
                                legendFormat = "Sent push"
                                refId        = "A"
                            },
                        ]
                        title       = "Dispatched Notifications"
                        type        = "timeseries"
                    },
                  ~ {
                      + alert       = {
                          + alertRuleTags       = {}
                          + conditions          = [
                              + {
                                  + evaluator = {
                                      + params = [
                                          + 100,
                                        ]
                                      + type   = "gt"
                                    }
                                  + operator  = {
                                      + type = "and"
                                    }
                                  + query     = {
                                      + params = [
                                          + "A",
                                          + "5m",
                                          + "now",
                                        ]
                                    }
                                  + reducer   = {
                                      + params = []
                                      + type   = "sum"
                                    }
                                  + type      = "query"
                                },
                            ]
                          + executionErrorState = "alerting"
                          + for                 = "5m"
                          + frequency           = "1m"
                          + handler             = 1
                          + message             = "Cast failing to send messages, potential problem with Cast <-> Relay communication."
                          + name                = "staging Cast failing on send (communicating with relay)"
                          + noDataState         = "no_data"
                          + notifications       = [
                              + {
                                  + uid = "l_iaPw6nk"
                                },
                            ]
                        }
                      ~ fieldConfig = {
                          ~ defaults  = {
                              ~ custom     = {
                                  ~ thresholdsStyle   = {
                                      ~ mode = "off" -> "line"
                                    }
                                    # (15 unchanged attributes hidden)
                                }
                              + max        = 1000
                              ~ thresholds = {
                                  ~ steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                      ~ {
                                          ~ value = 80 -> 100
                                            # (1 unchanged attribute hidden)
                                        },
                                    ]
                                    # (1 unchanged attribute hidden)
                                }
                                # (2 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                      + thresholds  = [
                          + {
                              + colorMode = "critical"
                              + op        = "gt"
                              + value     = 100
                              + visible   = true
                            },
                        ]
                        # (6 unchanged attributes hidden)
                    },
                    {
                        datasource  = {
                            type = "prometheus"
                            uid  = "O62eDFJVz"
                        }
                        fieldConfig = {
                            defaults  = {
                                color      = {
                                    fixedColor = "light-yellow"
                                    mode       = "fixed"
                                }
                                custom     = {
                                    axisLabel         = ""
                                    axisPlacement     = "auto"
                                    barAlignment      = 0
                                    drawStyle         = "line"
                                    fillOpacity       = 0
                                    gradientMode      = "none"
                                    hideFrom          = {
                                        legend  = false
                                        tooltip = false
                                        viz     = false
                                    }
                                    lineInterpolation = "linear"
                                    lineStyle         = {
                                        fill = "solid"
                                    }
                                    lineWidth         = 1
                                    pointSize         = 5
                                    scaleDistribution = {
                                        type = "linear"
                                    }
                                    showPoints        = "auto"
                                    spanNulls         = false
                                    stacking          = {
                                        group = "A"
                                        mode  = "none"
                                    }
                                    thresholdsStyle   = {
                                        mode = "off"
                                    }
                                }
                                mappings   = []
                                thresholds = {
                                    mode  = "absolute"
                                    steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                        {
                                            color = "red"
                                            value = 80
                                        },
                                    ]
                                }
                            }
                            overrides = []
                        }
                        gridPos     = {
                            h = 8
                            w = 12
                            x = 12
                            y = 26
                        }
                        options     = {
                            legend  = {
                                calcs       = []
                                displayMode = "list"
                                placement   = "bottom"
                            }
                            tooltip = {
                                mode = "single"
                                sort = "none"
                            }
                        }
                        targets     = [
                            {
                                datasource   = {
                                    type = "prometheus"
                                    uid  = "O62eDFJVz"
                                }
                                exemplar     = true
                                expr         = "increase(dispatched_notifications{type=\"not_found\"}[5m])"
                                interval     = ""
                                legendFormat = "Not found"
                                refId        = "A"
                            },
                        ]
                        title       = "Not found accounts"
                        type        = "timeseries"
                    },
                    {
                        collapsed = false
                        gridPos   = {
                            h = 1
                            w = 24
                            x = 0
                            y = 34
                        }
                        panels    = []
                        title     = "AWS Load Balancer"
                        type      = "row"
                    },
                  ~ {
                      + alert       = {
                          + alertRuleTags       = {}
                          + conditions          = [
                              + {
                                  + evaluator = {
                                      + params = [
                                          + 100,
                                        ]
                                      + type   = "gt"
                                    }
                                  + operator  = {
                                      + type = "and"
                                    }
                                  + query     = {
                                      + params = [
                                          + "A",
                                          + "5m",
                                          + "now",
                                        ]
                                    }
                                  + reducer   = {
                                      + params = []
                                      + type   = "sum"
                                    }
                                  + type      = "query"
                                },
                              + {
                                  + evaluator = {
                                      + params = [
                                          + 100,
                                        ]
                                      + type   = "gt"
                                    }
                                  + operator  = {
                                      + type = "or"
                                    }
                                  + query     = {
                                      + params = [
                                          + "A",
                                          + "5m",
                                          + "now",
                                        ]
                                    }
                                  + reducer   = {
                                      + params = []
                                      + type   = "sum"
                                    }
                                  + type      = "query"
                                },
                            ]
                          + executionErrorState = "alerting"
                          + for                 = "5m"
                          + frequency           = "1m"
                          + handler             = 1
                          + message             = "Cast is sending too much 4XX messages"
                          + name                = "staging Cast Server 4XX alert"
                          + noDataState         = "no_data"
                          + notifications       = [
                              + {
                                  + uid = "l_iaPw6nk"
                                },
                            ]
                        }
                      ~ fieldConfig = {
                          ~ defaults  = {
                              ~ custom     = {
                                  ~ thresholdsStyle   = {
                                      ~ mode = "off" -> "line"
                                    }
                                    # (14 unchanged attributes hidden)
                                }
                              + max        = 1000
                              ~ thresholds = {
                                  ~ steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                      ~ {
                                          ~ value = 80 -> 100
                                            # (1 unchanged attribute hidden)
                                        },
                                    ]
                                    # (1 unchanged attribute hidden)
                                }
                                # (2 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                      + thresholds  = [
                          + {
                              + colorMode = "critical"
                              + op        = "gt"
                              + value     = 100
                              + visible   = true
                            },
                        ]
                        # (6 unchanged attributes hidden)
                    },
                  ~ {
                      + alert       = {
                          + alertRuleTags       = {}
                          + conditions          = [
                              + {
                                  + evaluator = {
                                      + params = [
                                          + 100,
                                        ]
                                      + type   = "gt"
                                    }
                                  + operator  = {
                                      + type = "and"
                                    }
                                  + query     = {
                                      + params = [
                                          + "A",
                                          + "5m",
                                          + "now",
                                        ]
                                    }
                                  + reducer   = {
                                      + params = []
                                      + type   = "sum"
                                    }
                                  + type      = "query"
                                },
                              + {
                                  + evaluator = {
                                      + params = [
                                          + 100,
                                        ]
                                      + type   = "gt"
                                    }
                                  + operator  = {
                                      + type = "or"
                                    }
                                  + query     = {
                                      + params = [
                                          + "A",
                                          + "5m",
                                          + "now",
                                        ]
                                    }
                                  + reducer   = {
                                      + params = []
                                      + type   = "sum"
                                    }
                                  + type      = "query"
                                },
                            ]
                          + executionErrorState = "alerting"
                          + for                 = "5m"
                          + frequency           = "1m"
                          + handler             = 1
                          + message             = "Cast throwing multiple  5xx errors."
                          + name                = "staging Cast Server 5XX alert"
                          + noDataState         = "no_data"
                          + notifications       = []
                        }
                      ~ fieldConfig = {
                          ~ defaults  = {
                              ~ custom     = {
                                  ~ thresholdsStyle   = {
                                      ~ mode = "off" -> "line"
                                    }
                                    # (14 unchanged attributes hidden)
                                }
                              + max        = 1000
                              ~ thresholds = {
                                  ~ steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                      ~ {
                                          ~ value = 80 -> 100
                                            # (1 unchanged attribute hidden)
                                        },
                                    ]
                                    # (1 unchanged attribute hidden)
                                }
                                # (2 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                      + thresholds  = [
                          + {
                              + colorMode = "critical"
                              + op        = "gt"
                              + value     = 100
                              + visible   = true
                            },
                        ]
                        # (6 unchanged attributes hidden)
                    },
                    {
                        datasource  = {
                            type = "cloudwatch"
                            uid  = "qnpeDK1Vk"
                        }
                        fieldConfig = {
                            defaults  = {
                                color      = {
                                    mode = "palette-classic"
                                }
                                custom     = {
                                    axisLabel         = ""
                                    axisPlacement     = "auto"
                                    barAlignment      = 0
                                    drawStyle         = "line"
                                    fillOpacity       = 0
                                    gradientMode      = "none"
                                    hideFrom          = {
                                        legend  = false
                                        tooltip = false
                                        viz     = false
                                    }
                                    lineInterpolation = "linear"
                                    lineWidth         = 1
                                    pointSize         = 5
                                    scaleDistribution = {
                                        type = "linear"
                                    }
                                    showPoints        = "auto"
                                    spanNulls         = false
                                    stacking          = {
                                        group = "A"
                                        mode  = "none"
                                    }
                                    thresholdsStyle   = {
                                        mode = "off"
                                    }
                                }
                                mappings   = []
                                thresholds = {
                                    mode  = "absolute"
                                    steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                        {
                                            color = "red"
                                            value = 80
                                        },
                                    ]
                                }
                            }
                            overrides = []
                        }
                        gridPos     = {
                            h = 10
                            w = 7
                            x = 14
                            y = 35
                        }
                        options     = {
                            legend  = {
                                calcs       = []
                                displayMode = "list"
                                placement   = "bottom"
                            }
                            tooltip = {
                                mode = "single"
                                sort = "none"
                            }
                        }
                        targets     = [
                            {
                                alias            = ""
                                datasource       = {
                                    type = "cloudwatch"
                                    uid  = "qnpeDK1Vk"
                                }
                                dimensions       = {
                                    LoadBalancer = "app/staging-cast-load-balancer/35c451d7a89384ee"
                                }
                                expression       = ""
                                id               = ""
                                matchExact       = true
                                metricEditorMode = 0
                                metricName       = "RequestCount"
                                metricQueryType  = 0
                                namespace        = "AWS/ApplicationELB"
                                period           = ""
                                queryMode        = "Metrics"
                                refId            = "A"
                                region           = "default"
                                sqlExpression    = ""
                                statistic        = "Sum"
                            },
                        ]
                        title       = "Request"
                        type        = "timeseries"
                    },
                ]
                tags                 = []
              ~ title                = "staging-cast" -> "prod-cast"
              ~ uid                  = "staging-cast" -> "prod-cast"
                # (14 unchanged attributes hidden)
            }
        )
        id           = "0:staging-cast"
        # (7 unchanged attributes hidden)
    }

  # module.o11y.grafana_data_source.cloudwatch will be updated in-place
  ~ resource "grafana_data_source" "cloudwatch" {
        id                 = "101"
      ~ json_data_encoded  = jsonencode(
          ~ {
              - manageAlerts  = false
              - sigV4Auth     = false
              - timescaledb   = false
              - xpack         = false
                # (1 unchanged attribute hidden)
            }
        )
        name               = "staging-staging-cast-cloudwatch"
        # (5 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - default_region                = "eu-central-1" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = false -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

  # module.o11y.grafana_data_source.prometheus will be updated in-place
  ~ resource "grafana_data_source" "prometheus" {
        id                 = "102"
      ~ json_data_encoded  = jsonencode(
          ~ {
              - timescaledb   = false
              - xpack         = false
                # (5 unchanged attributes hidden)
            }
        )
        name               = "staging-staging-cast-amp"
        # (6 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - http_method                   = "GET" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = true -> null
          - sigv4_auth_type               = "workspace-iam-role" -> null
          - sigv4_region                  = "eu-central-1" -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

Plan: 12 to add, 4 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.analytics.aws_kms_alias.analytics_bucket will be created%0A  + resource "aws_kms_alias" "analytics_bucket" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + name           = "alias/analytics/cast/staging"%0A      + name_prefix    = (known after apply)%0A      + target_key_arn = (known after apply)%0A      + target_key_id  = (known after apply)%0A    }%0A%0A  # module.analytics.aws_kms_key.analytics_bucket will be created%0A  + resource "aws_kms_key" "analytics_bucket" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + deletion_window_in_days            = 10%0A      + description                        = "cast.staging - analytics bucket encryption"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = (known after apply)%0A      + tags_all                           = {%0A          + "Name"      = "walletconnect-staging-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "staging"%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket" "analytics-data-lake_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "walletconnect.cast.staging.analytics.data-lake"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "Name"      = "walletconnect-staging-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "staging"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl will be created%0A  + resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {%0A      + acl    = "private"%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A    }%0A%0A  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + bucket_key_enabled = true%0A%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = (known after apply)%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket will be created%0A  + resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"%0A        name                               = "staging-cast-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:29" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:29" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging-cast" -> (known after apply)%0A      ~ revision                 = 29 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access will be created%0A  + resource "aws_iam_policy" "analytics-data-lake_bucket_access" {%0A      + arn         = (known after apply)%0A      + description = "Allows staging-cast to read/write from walletconnect.cast.staging.analytics.data-lake"%0A      + id          = (known after apply)%0A      + name        = "staging-cast_analytics-data-lake_bucket_access"%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "Name"      = "walletconnect-staging-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "staging"%0A        }%0A    }%0A%0A  # module.ecs.aws_iam_policy.geoip_bucket_access will be created%0A  + resource "aws_iam_policy" "geoip_bucket_access" {%0A      + arn         = (known after apply)%0A      + description = "Allows staging-cast to read from staging.relay.geo.ip.database.private.staging.walletconnect"%0A      + id          = (known after apply)%0A      + name        = "staging-cast_geoip_bucket_access"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:ListBucket",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect",%0A                        ]%0A                      + Sid      = "ListObjectsInGeoipBucket"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:CopyObject",%0A                          + "s3:GetObject",%0A                          + "s3:HeadObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect/*",%0A                        ]%0A                      + Sid      = "AllObjectActionsInGeoipBucket"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "Name"      = "walletconnect-staging-cast"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "staging"%0A        }%0A    }%0A%0A  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach will be created%0A  + resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "staging-cast-ecs-task-execution-role"%0A    }%0A%0A  # module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach will be created%0A  + resource "aws_iam_role_policy_attachment" "geoip-bucket-policy-attach" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "staging-cast-ecs-task-execution-role"%0A    }%0A%0A  # module.o11y.grafana_dashboard.at_a_glance will be updated in-place%0A  ~ resource "grafana_dashboard" "at_a_glance" {%0A      ~ config_json  = jsonencode(%0A          ~ {%0A              ~ panels               = [%0A                    {%0A                        collapsed = false%0A                        gridPos   = {%0A                            h = 1%0A                            w = 24%0A                            x = 0%0A                            y = 0%0A                        }%0A                        panels    = []%0A                        title     = "Database"%0A                        type      = "row"%0A                    },%0A                  ~ {%0A                      ~ targets     = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "staging-cast-keystore-docdb-primary-cluster" -> "prod-cast-keystore-docdb-primary-cluster"%0A                                }%0A                                id               = ""%0A                                # (14 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (6 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets     = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "staging-cast-keystore-docdb-primary-cluster" -> "prod-cast-keystore-docdb-primary-cluster"%0A                                }%0A                                id               = ""%0A                                # (14 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (6 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets     = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "staging-cast-keystore-docdb-primary-cluster" -> "prod-cast-keystore-docdb-primary-cluster"%0A                                }%0A                                id               = ""%0A                                # (14 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (6 unchanged attributes hidden)%0A                    },%0A                  ~ {%0A                      ~ targets     = [%0A                          ~ {%0A                              ~ dimensions       = {%0A                                  ~ DBClusterIdentifier = "staging-cast-keystore-docdb-primary-cluster" -> "prod-cast-keystore-docdb-primary-cluster"%0A                                }%0A                                id               = ""%0A                                # (14 unchanged attributes hidden)%0A                            },%0A                        ]%0A                        # (7 unchanged attributes hidden)%0A                    },%0A                    {%0A                        collapsed = true%0A                        gridPos   = {%0A                            h = 1%0A                            w = 24%0A                            x = 0%0A                            y = 17%0A                        }%0A                        panels    = []%0A                        title     = "Graphs"%0A                        type      = "row"%0A                    },%0A                    # (1 unchanged element hidden)%0A                    {%0A                        datasource  = {%0A                            type = "prometheus"%0A                            uid  = "O62eDFJVz"%0A                        }%0A                        fieldConfig = {%0A                            defaults  = {%0A                                color      = {%0A                                    mode = "palette-classic"%0A                                }%0A                                custom     = {%0A                                    axisLabel         = ""%0A                                    axisPlacement     = "auto"%0A                                    barAlignment      = 0%0A                                    drawStyle         = "line"%0A                                    fillOpacity       = 0%0A                                    gradientMode      = "none"%0A                                    hideFrom          = {%0A                                        legend  = false%0A                                        tooltip = false%0A                                        viz     = false%0A                                    }%0A                                    lineInterpolation = "linear"%0A                                    lineStyle         = {%0A                                        fill = "solid"%0A                                    }%0A                                    lineWidth         = 1%0A                                    pointSize         = 5%0A                                    scaleDistribution = {%0A                                        type = "linear"%0A                                    }%0A                                    showPoints        = "auto"%0A                                    spanNulls         = false%0A                                    stacking          = {%0A                                        group = "A"%0A                                        mode  = "none"%0A                                    }%0A                                    thresholdsStyle   = {%0A                                        mode = "off"%0A                                    }%0A                                }%0A                                mappings   = []%0A                                thresholds = {%0A                                    mode  = "absolute"%0A                                    steps = [%0A                                        {%0A                                            color = "green"%0A                                            value = null%0A                                        },%0A                                        {%0A                                            color = "red"%0A                                            value = 80%0A                                        },%0A                                    ]%0A                                }%0A                            }%0A                            overrides = []%0A                        }%0A                        gridPos     = {%0A                            h = 8%0A                            w = 12%0A                            x = 12%0A                            y = 18%0A                        }%0A                        options     = {%0A                            legend  = {%0A                                calcs       = []%0A                                displayMode = "list"%0A                                placement   = "bottom"%0A                            }%0A                            tooltip = {%0A                                mode = "single"%0A                                sort = "none"%0A                            }%0A                        }%0A                        targets     = [%0A                            {%0A                                datasource   = {%0A                                    type = "prometheus"%0A                                    uid  = "O62eDFJVz"%0A                                }%0A                                exemplar     = true%0A                                expr         = "increase(dispatched_notifications{type=\"sent\"}[5m])"%0A                                interval     = ""%0A                                legendFormat = "Sent push"%0A                                refId        = "A"%0A                            },%0A                        ]%0A                        title       = "Dispatched Notifications"%0A                        type        = "timeseries"%0A                    },%0A                  ~ {%0A                      + alert       = {%0A                          + alertRuleTags       = {}%0A                          + conditions          = [%0A                              + {%0A                                  + evaluator = {%0A                                      + params = [%0A                                          + 100,%0A                                        ]%0A                                      + type   = "gt"%0A                                    }%0A                                  + operator  = {%0A                                      + type = "and"%0A                                    }%0A                                  + query     = {%0A                                      + params = [%0A                                          + "A",%0A                                          + "5m",%0A                                          + "now",%0A                                        ]%0A                                    }%0A                                  + reducer   = {%0A                                      + params = []%0A                                      + type   = "sum"%0A                                    }%0A                                  + type      = "query"%0A                                },%0A                            ]%0A                          + executionErrorState = "alerting"%0A                          + for                 = "5m"%0A                          + frequency           = "1m"%0A                          + handler             = 1%0A                          + message             = "Cast failing to send messages, potential problem with Cast <-> Relay communication."%0A                          + name                = "staging Cast failing on send (communicating with relay)"%0A                          + noDataState         = "no_data"%0A                          + notifications       = [%0A                              + {%0A                                  + uid = "l_iaPw6nk"%0A                                },%0A                            ]%0A                        }%0A                      ~ fieldConfig = {%0A                          ~ defaults  = {%0A                              ~ custom     = {%0A                                  ~ thresholdsStyle   = {%0A                                      ~ mode = "off" -> "line"%0A                                    }%0A                                    # (15 unchanged attributes hidden)%0A                                }%0A                              + max        = 1000%0A                              ~ thresholds = {%0A                                  ~ steps = [%0A                                        {%0A                                            color = "green"%0A                                            value = null%0A                                        },%0A                                      ~ {%0A                                          ~ value = 80 -> 100%0A                                            # (1 unchanged attribute hidden)%0A                                        },%0A                                    ]%0A                                    # (1 unchanged attribute hidden)%0A                                }%0A                                # (2 unchanged attributes hidden)%0A                            }%0A                            # (1 unchanged attribute hidden)%0A                        }%0A                      + thresholds  = [%0A                          + {%0A                              + colorMode = "critical"%0A                              + op        = "gt"%0A                              + value     = 100%0A                              + visible   = true%0A                            },%0A                        ]%0A                        # (6 unchanged attributes hidden)%0A                    },%0A                    {%0A                        datasource  = {%0A                            type = "prometheus"%0A                            uid  = "O62eDFJVz"%0A                        }%0A                        fieldConfig = {%0A                            defaults  = {%0A                                color      = {%0A                                    fixedColor = "light-yellow"%0A                                    mode       = "fixed"%0A                                }%0A                                custom     = {%0A                                    axisLabel         = ""%0A                                    axisPlacement     = "auto"%0A                                    barAlignment      = 0%0A                                    drawStyle         = "line"%0A                                    fillOpacity       = 0%0A                                    gradientMode      = "none"%0A                                    hideFrom          = {%0A                                        legend  = false%0A                                        tooltip = false%0A                                        viz     = false%0A                                    }%0A                                    lineInterpolation = "linear"%0A                                    lineStyle         = {%0A                                        fill = "solid"%0A                                    }%0A                                    lineWidth         = 1%0A                                    pointSize         = 5%0A                               
...

```

</details>

*Action: `pull_request`*